Revit 2027 API
BuiltInFailures.RoomFailures.AreaTagBadViewType Property
 Can't Copy Area Tags. The target view doesn't have the same Area Scheme as the original view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AreaTagBadViewType { get; }
Public Shared ReadOnly Property AreaTagBadViewType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AreaTagBadViewType {
	FailureDefinitionId^ get ();
}
static member AreaTagBadViewType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace